# NumberOfPhases Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalDistributionNodePropertyData..::..NumberOfPhases Property
AnalyticalDistributionNodePropertyData Class See Also
---
The number of phases.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public int NumberOfPhases { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfPhases As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfPhases {
	int get ();
}
```

# See Also
AnalyticalDistributionNodePropertyData Class
Autodesk.Revit.DB.Electrical Namespace